Revit 2026 API

# SpatialFieldManagerCurrentMeasurement Property

---

Stores the currently displayed measurement

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int CurrentMeasurement { get; set; }
```
```vb
Public Property CurrentMeasurement As Integer
	Get
	Set
```
```cpp
public:
property int CurrentMeasurement {
	int get ();
	void set (int value);
}
```
```fsharp
member CurrentMeasurement : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: measurement is not in the range from 0 to (number of measurements - 1) |

Must be in the range from 0 to (numberOfMeasurements - 1)

#### Reference

SpatialFieldManager Class

Autodesk.Revit.DB.Analysis Namespace